## Production: elasticache
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 12 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                    |
|--------|----------------------------------------------------------------------------|
| update | `aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[0]` |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[1]` |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[2]` |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[0]`        |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[1]`        |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[2]`        |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[0]`  |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[1]`  |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[2]`  |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[0]`      |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[1]`      |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[2]`      |
| add    | `aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-critical[0]` |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-critical[1]` |
|        | `aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-critical[2]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-connection-warning" {
        id                        = "redis-elasticache-high-connection-warning-CacheCluster001"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[1] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-connection-warning" {
        id                        = "redis-elasticache-high-connection-warning-CacheCluster002"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[2] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-connection-warning" {
        id                        = "redis-elasticache-high-connection-warning-CacheCluster003"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-cpu-warning" {
        id                        = "redis-elasticache-high-cpu-warning-CacheCluster001CPUUtilization"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[1] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-cpu-warning" {
        id                        = "redis-elasticache-high-cpu-warning-CacheCluster002CPUUtilization"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[2] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-cpu-warning" {
        id                        = "redis-elasticache-high-cpu-warning-CacheCluster003CPUUtilization"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-critical[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-db-memory-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
      + alarm_name                            = "redis-elasticache-high-db-memory-critical-CacheCluster001"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-production-cluster-cache-az-001"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-critical[1] will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-db-memory-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
      + alarm_name                            = "redis-elasticache-high-db-memory-critical-CacheCluster002"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-production-cluster-cache-az-002"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-critical[2] will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-db-memory-critical" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + alarm_description                     = "Average DB Memory on Redis ElastiCache >= 85% during 1 minute"
      + alarm_name                            = "redis-elasticache-high-db-memory-critical-CacheCluster003"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notify-production-cluster-cache-az-003"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseMemoryUsagePercentage"
      + namespace                             = "AWS/ElastiCache"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 85
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-db-memory-warning" {
        id                        = "redis-elasticache-high-db-memory-warning-CacheCluster001"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[1] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-db-memory-warning" {
        id                        = "redis-elasticache-high-db-memory-warning-CacheCluster002"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[2] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-high-db-memory-warning" {
        id                        = "redis-elasticache-high-db-memory-warning-CacheCluster003"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-medium-cpu-warning" {
        id                        = "redis-elasticache-medium-cpu-warning-CacheCluster001CPUUtilization"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[1] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-medium-cpu-warning" {
        id                        = "redis-elasticache-medium-cpu-warning-CacheCluster002CPUUtilization"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[2] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "redis-elasticache-medium-cpu-warning" {
        id                        = "redis-elasticache-medium-cpu-warning-CacheCluster003CPUUtilization"
      ~ ok_actions                = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

Plan: 3 to add, 12 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_elasticache_replication_group.notification-cluster-cache-multiaz-group,
  on elasticache.tf line 21, in resource "aws_elasticache_replication_group" "notification-cluster-cache-multiaz-group":
  21:   replication_group_description = "Redis multiaz cluster with replication group"

Use description instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-elasticache-engine-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-elasticache-slow-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-critical[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-critical[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning[2]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning[1]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
